<a href="https://colab.research.google.com/github/p1tuo/20201104-work/blob/main/Untitled9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'], 
                   'data1' : np.random.randn(5), 
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.245324 -0.055012
1    a  two -0.533021  0.764434
2    b  one -1.337645  0.243507
3    b  two -1.367908  1.783435
4    a  one -0.997639  1.172335

In [3]:
grouped  =  df [ 'data1' ] . groupby ( df [ 'key1' ])

In [4]:
grouped

In [5]:
grouped . mean ()

key1
a   -0.925328
b   -1.352777
Name: data1, dtype: float64

In [6]:
means  =  df [ 'data1' ] . groupby ([ df [ 'key1' ],  df [ 'key2' ]]) . mean () 
means

key1  key2
a     one    -1.121481
      two    -0.533021
b     one    -1.337645
      two    -1.367908
Name: data1, dtype: float64

In [7]:
means . unstack ()

key2       one       two
key1
a    -1.121481 -0.533021
b    -1.337645 -1.367908

In [8]:
states  =  np . array ([ 'Ohio' ,  'California' ,  'California' ,  'Ohio' ,  'Ohio' ])

In [9]:
years  =  np . array ([ 2005 ,  2005 ,  2006 ,  2005 ,  2006 ])

In [10]:
df [ 'data1' ] . groupby ([ states ,  years ]) . mean ()

California  2005   -0.533021
            2006   -1.337645
Ohio        2005   -1.306616
            2006   -0.997639
Name: data1, dtype: float64

In [11]:
df [ 'data1' ] . groupby ([ states ,  years ])

In [12]:
df [ 'data1' ]

0   -1.245324
1   -0.533021
2   -1.337645
3   -1.367908
4   -0.997639
Name: data1, dtype: float64

In [13]:
df

  key1 key2     data1     data2
0    a  one -1.245324 -0.055012
1    a  two -0.533021  0.764434
2    b  one -1.337645  0.243507
3    b  two -1.367908  1.783435
4    a  one -0.997639  1.172335

In [14]:
df . groupby ( 'key1' ) . mean ()

         data1     data2
key1
a    -0.925328  0.627252
b    -1.352777  1.013471

In [15]:
df . groupby ([ 'key1' ,  'key2' ]) . mean ()

              data1     data2
key1 key2
a    one  -1.121481  0.558662
     two  -0.533021  0.764434
b    one  -1.337645  0.243507
     two  -1.367908  1.783435

In [16]:
df . groupby ([ 'key1' ,  'key2' ]) . size ()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [18]:
for  name ,  group  in  df . groupby ( 'key1' ): 
    print ( name ) 
    print ( group  )

a
  key1 key2     data1     data2
0    a  one -1.245324 -0.055012
1    a  two -0.533021  0.764434
4    a  one -0.997639  1.172335
b
  key1 key2     data1     data2
2    b  one -1.337645  0.243507
3    b  two -1.367908  1.783435

In [19]:
for  ( k1 ,  k2 ),  group  in  df . groupby ([ 'key1' ,  'key2' ]): 
    print (( k1 ,  k2 )) 
    print ( group )

('a', 'one')
  key1 key2     data1     data2
0    a  one -1.245324 -0.055012
4    a  one -0.997639  1.172335
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.533021  0.764434
('b', 'one')
  key1 key2     data1     data2
2    b  one -1.337645  0.243507
('b', 'two')
  key1 key2     data1     data2
3    b  two -1.367908  1.783435

In [20]:
pieces  =  dict ( list ( df . groupby ( 'key1' )))

In [21]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one -1.245324 -0.055012
 1    a  two -0.533021  0.764434
 4    a  one -0.997639  1.172335, 'b':   key1 key2     data1     data2
 2    b  one -1.337645  0.243507
 3    b  two -1.367908  1.783435}

In [22]:
pieces [ 'b' ]

  key1 key2     data1     data2
2    b  one -1.337645  0.243507
3    b  two -1.367908  1.783435

In [23]:
df . dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [25]:
grouped  =  df . groupby ( df . dtypes ,  axis = 1 )

In [26]:
for  dtype ,  group  in  grouped : 
    print ( dtype ) 
    print ( group )

float64
      data1     data2
0 -1.245324 -0.055012
1 -0.533021  0.764434
2 -1.337645  0.243507
3 -1.367908  1.783435
4 -0.997639  1.172335
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [27]:
df

  key1 key2     data1     data2
0    a  one -1.245324 -0.055012
1    a  two -0.533021  0.764434
2    b  one -1.337645  0.243507
3    b  two -1.367908  1.783435
4    a  one -0.997639  1.172335

In [28]:
df . groupby ([ 'key1' ,  'key2' ])[[ 'data2' ]] . mean ()

              data2
key1 key2
a    one   0.558662
     two   0.764434
b    one   0.243507
     two   1.783435

In [29]:
s_grouped  =  df . groupby ([ 'key1' ,  'key2' ])[ 'data2' ] 
s_grouped

In [30]:
s_grouped . mean ()

key1  key2
a     one     0.558662
      two     0.764434
b     one     0.243507
      two     1.783435
Name: data2, dtype: float64

In [31]:
people  =  pd . DataFrame ( np . random . randn ( 5 ,  5 ), 
                      columns = [ 'a' ,  'b' ,  'c' ,  'd' ,  'e' ], 
                      index = [ 'Joe' ,  'Steve ' ,  'Wes' ,  'Jim' ,  'Travis' ])

In [32]:
people . iloc [ 2 : 3 ,  [ 1 ,  2 ]]  =  np . nan  # Add a few NA values

In [33]:
people

               a         b         c         d         e
Joe    -0.547169 -0.342653  0.484871  1.366036  1.169029
Steve   1.896872  0.873400  1.713491 -0.543853 -0.329545
Wes     0.412530       NaN       NaN -0.523228 -0.822844
Jim     0.631206 -0.728498 -2.196184  1.842603 -1.469742
Travis  0.903268 -0.754988 -0.906240  1.109236  1.090572

In [34]:
mapping  =  { 'a' :  'red' ,  'b' :  'red' ,  'c' :  'blue' , 
           'd' :  'blue' ,  'e' :  'red' ,  'f' :  'orange' }

In [35]:
by_column  =  people . groupby ( mapping ,  axis = 1 )

In [36]:
by_column . sum ()

            blue       red
Joe     1.850907  0.279207
Steve   1.169638  2.440726
Wes    -0.523228 -0.410314
Jim    -0.353581 -1.567034
Travis  0.202996  1.238853

In [37]:
map_series  =  pd . Series ( mapping ) 
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [38]:
people . groupby ( map_series ,  axis = 1 ) . count ()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3